{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 129, "output_dim": 25, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_2/forward_lstm_2/kernel", "shape": [25, 512], "dtype": "float32", "quantization": {"min": -1.2056678921568627, "scale": 0.010393688725490196, "dtype": "uint8"}}, {"name": "bidirectional_2/forward_lstm_2/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -1.3993183210784312, "scale": 0.011469822303921568, "dtype": "uint8"}}, {"name": "bidirectional_2/backward_lstm_2/kernel", "shape": [25, 512], "dtype": "float32", "quantization": {"min": -1.2374578737745097, "scale": 0.009899662990196078, "dtype": "uint8"}}, {"name": "bidirectional_2/backward_lstm_2/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -1.3363970588235294, "scale": 0.011136642156862745, "dtype": "uint8"}}, {"name": "bidirectional_3/forward_lstm_3/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"min": -2.41842830882353, "scale": 0.016122855392156864, "dtype": "uint8"}}, {"name": "bidirectional_3/forward_lstm_3/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -1.8410998774509804, "scale": 0.014847579656862744, "dtype": "uint8"}}, {"name": "bidirectional_3/backward_lstm_3/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"min": -2.0199333639705883, "scale": 0.014962469362745099, "dtype": "uint8"}}, {"name": "bidirectional_3/backward_lstm_3/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -3.657398897058824, "scale": 0.02216605392156863, "dtype": "uint8"}}, {"name": "dense_1/kernel", "shape": [128, 2], "dtype": "float32", "quantization": {"min": -7.710110294117647, "scale": 0.06217830882352941, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.423095703125, "scale": 0.001292269837622549, "dtype": "uint8"}}, {"name": "embedding_1/embeddings", "shape": [129, 25], "dtype": "float32", "quantization": {"min": -2.3998697916666667, "scale": 0.020166973039215687, "dtype": "uint8"}}]}]}