{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 129, "output_dim": 25, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional/forward_lstm/kernel", "shape": [25, 512], "dtype": "float32", "quantization": {"min": -1.1884535845588236, "scale": 0.009662224264705883, "dtype": "uint8"}}, {"name": "bidirectional/forward_lstm/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -2.0255284926470587, "scale": 0.013779105392156862, "dtype": "uint8"}}, {"name": "bidirectional/backward_lstm/kernel", "shape": [25, 512], "dtype": "float32", "quantization": {"min": -1.3877450980392156, "scale": 0.010841758578431372, "dtype": "uint8"}}, {"name": "bidirectional/backward_lstm/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -1.440096507352941, "scale": 0.012308517156862745, "dtype": "uint8"}}, {"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"min": -1.9765625, "scale": 0.014533547794117647, "dtype": "uint8"}}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -1.3814568014705881, "scale": 0.011707261029411765, "dtype": "uint8"}}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"min": -1.5894952512254903, "scale": 0.014066329656862745, "dtype": "uint8"}}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -2.4289139093137257, "scale": 0.01912530637254902, "dtype": "uint8"}}, {"name": "dense/kernel", "shape": [128, 2], "dtype": "float32", "quantization": {"min": -7.099034926470588, "scale": 0.06395526960784313, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.09002685546875, "scale": 0.0001922009037990196, "dtype": "uint8"}}, {"name": "embedding/embeddings", "shape": [129, 25], "dtype": "float32", "quantization": {"min": -2.8580882352941175, "scale": 0.02071078431372549, "dtype": "uint8"}}]}]}