{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 129, "output_dim": 25, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional/forward_lstm/kernel", "shape": [25, 512], "dtype": "float32", "quantization": {"min": -1.1622931985294116, "scale": 0.009934129901960784, "dtype": "uint8"}}, {"name": "bidirectional/forward_lstm/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -1.3383157169117645, "scale": 0.01037454044117647, "dtype": "uint8"}}, {"name": "bidirectional/backward_lstm/kernel", "shape": [25, 512], "dtype": "float32", "quantization": {"min": -1.115042892156863, "scale": 0.009612438725490197, "dtype": "uint8"}}, {"name": "bidirectional/backward_lstm/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -1.7939338235294118, "scale": 0.012457873774509805, "dtype": "uint8"}}, {"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"min": -1.7266773897058825, "scale": 0.012982536764705883, "dtype": "uint8"}}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -1.5647633272058823, "scale": 0.014096966911764706, "dtype": "uint8"}}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"min": -2.293795955882353, "scale": 0.015498621323529412, "dtype": "uint8"}}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -1.8652994791666666, "scale": 0.015674785539215686, "dtype": "uint8"}}, {"name": "dense/kernel", "shape": [128, 2], "dtype": "float32", "quantization": {"min": -10.016911764705883, "scale": 0.06590073529411765, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.1502685546875, "scale": 0.000511618221507353, "dtype": "uint8"}}, {"name": "embedding/embeddings", "shape": [129, 25], "dtype": "float32", "quantization": {"min": -3.0335477941176467, "scale": 0.021668198529411764, "dtype": "uint8"}}]}]}