{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 129, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional/forward_lstm/kernel", "shape": [32, 512], "dtype": "float32", "quantization": {"min": -1.3657169117647059, "scale": 0.010753676470588235, "dtype": "uint8"}}, {"name": "bidirectional/forward_lstm/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -1.6948069852941177, "scale": 0.01486672794117647, "dtype": "uint8"}}, {"name": "bidirectional/backward_lstm/kernel", "shape": [32, 512], "dtype": "float32", "quantization": {"min": -1.3755821078431372, "scale": 0.011657475490196079, "dtype": "uint8"}}, {"name": "bidirectional/backward_lstm/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -1.5458639705882353, "scale": 0.012775735294117647, "dtype": "uint8"}}, {"name": "bidirectional_1/forward_lstm_1/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"min": -2.1176470588235294, "scale": 0.016544117647058824, "dtype": "uint8"}}, {"name": "bidirectional_1/forward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -1.6784505208333333, "scale": 0.013216145833333333, "dtype": "uint8"}}, {"name": "bidirectional_1/backward_lstm_1/kernel", "shape": [256, 256], "dtype": "float32", "quantization": {"min": -1.7786764705882354, "scale": 0.01446078431372549, "dtype": "uint8"}}, {"name": "bidirectional_1/backward_lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"min": -2.5087545955882353, "scale": 0.017792585784313725, "dtype": "uint8"}}, {"name": "dense/kernel", "shape": [128, 2], "dtype": "float32", "quantization": {"min": -4.642003676470588, "scale": 0.05951286764705882, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [2], "dtype": "float32", "quantization": {"min": 0.16845703125, "scale": 2.8722426470588235e-05, "dtype": "uint8"}}, {"name": "embedding/embeddings", "shape": [129, 32], "dtype": "float32", "quantization": {"min": -2.39344362745098, "scale": 0.017861519607843136, "dtype": "uint8"}}]}]}