{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 129, "output_dim": 25, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional/forward_lstm/kernel", "shape": [25, 512], "dtype": "float32", "quantization": {"min": -1.718737602044709, "scale": 4.592607957579919e-05, "dtype": "uint16"}}, {"name": "bidirectional/forward_lstm/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -1.7890880707827876, "scale": 5.407713912413214e-05, "dtype": "uint16"}}, {"name": "bidirectional/backward_lstm/kernel", "shape": [25, 512], "dtype": "float32", "quantization": {"min": -1.4150168445296405, "scale": 4.6313515678645e-05, "dtype": "uint16"}}, {"name": "bidirectional/backward_lstm/recurrent_kernel", "shape": [128, 512], "dtype": "float32", "quantization": {"min": -2.1191642287994963, "scale": 6.230270561532005e-05, "dtype": "uint16"}}, {"name": "dense/kernel", "shape": [256, 2], "dtype": "float32", "quantization": {"min": -5.765593528267337, "scale": 0.0001326521610589761, "dtype": "uint16"}}, {"name": "dense/bias", "shape": [2], "dtype": "float32", "quantization": {"min": -0.271728515625, "scale": 1.5981739242389563e-06, "dtype": "uint16"}}, {"name": "embedding/embeddings", "shape": [129, 25], "dtype": "float32", "quantization": {"min": -2.4335986674582286, "scale": 7.644412336919203e-05, "dtype": "uint16"}}]}]}